<template>
  <v-dialog
    v-model="showPolicy"
    width="600px"
  >
    <template #activator="{ on, attrs }">
      <a
        class="text-decoration-underline secondary--text"
        v-bind="attrs"
        v-on="on"
      >
        <slot />
      </a>
    </template>
    <v-card>
      <v-btn
        icon
        class="mb-5 align-self-end"
        @click="showPolicy = false"
      >
        <v-icon>{{ mdiClose }}</v-icon>
      </v-btn>
      <v-card-title>
        <span class="text-h5">Пользовательское соглашение</span>
      </v-card-title>
      <v-card-text>
        <b>
          Внимательно ознакомьтесь с условиями
          настоящего Пользовательского соглашения
          до начала использования Сервиса. Если вы
          не согласны с условиями настоящего Соглашения
          и указанных в нем Обязательных документов или
          не имеете права на заключение договора на их
          основе, вам следует незамедлительно прекратить
          любое использование Сервиса.
        </b>
        <br>
        <br>
        <h3>1. Общие положения</h3>
        <h4>
          1.1. В настоящем документе и
          вытекающих или связанных с ним
          отношениях Сторон применяются
          следующие термины и определения:
        </h4>

        а) Сервис – совокупность
        функциональных возможностей программно-аппаратных
        средств Правообладателя, включая Сайт и
        Контент, к которым Пользователю
        предоставляется доступ в целях
        информационного обслуживания.
        <br>
        б) Сайт – автоматизированная
        информационная система, доступная
        в сети Интернет по адресу (включая
        поддомены) http://block-opt.ru.
        <br>
        в) Пользователь – вы и/или
        иное лицо, в интересах которого
        вы заключили настоящее Соглашение с
        Правообладателем в соответствии с
        требованиями действующего
        законодательства и настоящего Соглашения.
        <br>
        г) Контент – любые информационные
        материалы, включая текстовые, графические,
        аудиовизуальные и прочие материалы, к
        которым можно получить доступ с
        использованием Сервиса.
        <br>
        <h4>
          1.2. Использование вами
          Сервиса любым способом и в
          любой форме в пределах его
          объявленных функциональных возможностей,
          включая:
        </h4>

        - просмотр Контента в рамках Сервиса;<br>
        - оформление подписки на информационную
        рассылку;<br>
        - направление сообщения с
        использованием онлайн-форм на Сайте;<br>
        - обращение в службу поддержки
        Сайта по реквизитам, размещенным на Сайте;<br>
        - иное использование Сервиса,
        создает договор на условиях
        настоящего Соглашения и указанных
        в нем обязательных для Сторон
        документов в соответствии с
        положениями ст.437 и 438
        Гражданского кодекса Российской Федерации.

        <h4>
          1.3. Воспользовавшись любой
          из указанных выше возможностей
          по использованию Сервиса вы
          подтверждаете, что:
        </h4>

        а) Ознакомились с условиями
        настоящего Соглашения и
        указанных в нем Обязательных
        документов в полном объеме до
        начала использования Сервиса.
        <br>
        б) Принимаете все условия
        настоящего Соглашения и
        указанных в нем Обязательных
        документов в полном объеме
        без каких-либо изъятий и ограничений
        с вашей стороны и обязуетесь их
        соблюдать или прекратить
        использование Сервиса.

        <h3>2. Общие условия пользования Сервисом</h3>
        <h4>
          2.1. Обязательным условием
          заключения настоящего Соглашения
          является полное и безоговорочное принятие
          и соблюдение Пользователем в установленных
          ниже случаях требований и положений,
          определенных следующими документами
          («Обязательные документы»):
        </h4>

        а) Политика конфиденциальности,
        размещенная и/или доступная на Сайте,
        которая содержит правила предоставления и
        использования конфиденциальной информации,
        включая персональные данные Пользователя.

        <h4>
          2.2. Правообладатель вправе
          устанавливать лимиты и вводить
          иные технические ограничения использования
          Сервиса, которые время от времени будут
          доводиться до сведения Пользователей в
          форме и способом по выбору Правообладателя.
        </h4>

        <h3>3. Ограничения</h3>
        Соглашаясь с условиями настоящего
        Пользовательского соглашения, вы
        понимаете и признаете, что:

        <h4>
          3.1. К отношениям Сторон по
          предоставлению Сервиса на безвозмездной
          основе не подлежат применению положения
          законодательства о защите прав потребителей.
        </h4>

        <h4>
          3.2. Сервис предоставляется для
          использования в информационно-развлекательных
          целях на условиях «как есть», в связи с чем
          Пользователям не представляются какие-либо
          гарантии, что Сервис будет соответствовать
          всем требованиям Пользователя; услуги будут
          предоставляться непрерывно, быстро, надежно
          и без ошибок; результаты, которые могут быть
          получены с использованием Сервиса, будут
          точными и надежными; качество какого-либо
          продукта, услуги, информации и Контента,
          полученных с использованием Сервиса, будет
          соответствовать ожиданиям Пользователя;
          все ошибки в Контенте и/или программном
          обеспечении Сервиса будут исправлены.
        </h4>

        <h4>
          3.3. Поскольку Сервис находится на
          стадии постоянного дополнения и обновления
          новых функциональных возможностей, форма
          и характер предоставляемых услуг могут
          время от времени меняться без предварительного
          уведомления Пользователя. Правообладатель
          вправе по собственному усмотрению прекратить
          (временно или окончательно) предоставление
          услуг (или каких-либо отдельных функций
          в рамках услуг) всем Пользователям вообще
          или вам, в частности, без вашего
          предварительного уведомления.
        </h4>

        <h4>
          3.4. Пользователь не имеет права
          самостоятельно или с привлечением третьих лиц:
        </h4>

        копировать (воспроизводить) в любой
        форме и способом входящие в состав
        Сервиса Правообладателя программы для
        ЭВМ и базы данных, включая любые их элементы
        и Контент, без получения предварительного
        письменного согласия их владельца;
        вскрывать технологию, эмулировать,
        декомпилировать, дизассемблировать, дешифровать, и
        производить иные аналогичные действия с Сервисом;
        создавать программные продукты и/или сервисы с
        использованием Сервиса без получения
        предварительного разрешения Правообладателя.
        <h4>
          3.5. При обнаружении ошибок в работе
          Сервиса или в размещенном на нем Контенте
          сообщите об этом Правообладателю по адресу,
          указанному в реквизитах или отдельно на Сайте
          для службы поддержки.
        </h4>

        <h3>4. Уведомления</h3>
        <h4>
          4.1. Пользователь соглашается получать
          от Правообладателя на электронный адрес
          и/или абонентский номер телефона, указанный
          вами при работе с Сервисом, информационные
          электронные сообщения (далее — «нотификаторы»).
        </h4>

        <h4>
          4.2. Правообладатель вправе использовать
          нотификаторы для информирования Пользователя
          об изменениях и новых возможностях Сервиса, об
          изменении Соглашения или указанных в нем Обязательных
          документов, а также для рассылок информационного
          или рекламного характера.
        </h4>

        <h3>5. Прочие условия</h3>
        <h4>
          5.1. Настоящее Пользовательское соглашение,
          порядок его заключения и исполнения, а также
          вопросы, не урегулированные настоящим Соглашением,
          регулируются действующим законодательством
          Российской Федерации.
        </h4>

        <h4>
          5.2. Все споры по Соглашению или в связи
          с ним подлежат рассмотрению в суде по месту
          нахождения Правообладателя в соответствии с
          действующим процессуальным правом Российской
          Федерации.
        </h4>

        <h4>
          5.3. Настоящее Соглашение может быть
          изменено или прекращено Правообладателем в
          одностороннем порядке без предварительного
          уведомления Пользователя и без выплаты
          какой-либо компенсации в связи с этим.
        </h4>
      </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
import { mdiClose } from '@mdi/js';

export default {
  name: 'Policy',
  data() {
    return {
      mdiClose,
      showPolicy: false,
    };
  },
};
</script>
<style lang="scss" scoped>
h3{
  padding: 8px 0 16px;
}
h4{
  padding: 4px 0 8px;
}

</style>
